Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections
The direction of the exaggeration.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections.LeftDown
Left / Down.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections.RightUp
Right / Up.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections.Both
Both Left/Down and Right / Up.